# `brew tap Homebrew/bundle`
# `brew bundle --file=~/.dotfiles/homebrew/.brewfile`

# Base packages
brew 'zsh'
brew 'git'
brew 'tmux'
brew 'dnsmasq'
brew 'pass'
brew 'rsync'
brew 'ssh-copy-id'
brew 'wget'
brew 'tree'

# Languages
brew 'python'
brew 'python3'
brew 'go'
brew 'lua'
brew 'rust'

# Tools
brew 'irssi'
brew 'emacs'
brew 'vim'
