# cask_args appdir: "~/Applications", require_sha: true

# TODO: Install v2box, wireguard, outline, canary mail, zed editor, zen browser, amneziavpn, meeter

brew "neovim"
brew "ncdu"
brew "hl"
brew "kubernetes-cli"
brew "helmfile"
brew "helm"
brew "tmux"
brew "fzf"
brew "stow"
brew "ansible"
brew "git"
brew "bat"
brew "glow"
# TODO: Use mise.
brew "bazel"
# TODO: Use mise.
brew "biome"
brew "tealdeer"
# TODO: Add explicit tap.
brew "joshmedeski/sesh/sesh"
brew "tree"
brew "htop"
brew "coreutils"
brew "diffutils"
# TODO: Use mise.
brew "uv"
brew "ctop"
brew "d2"
brew "wget"
brew "curl"
brew "wrk"
brew "jq"
brew "yq"
brew "xplr"
brew "k6"
brew "ripgrep"
brew "duf"
brew "dust"
brew "dua-cli"
brew "lazydocker"
brew "lazygit"
brew "eza"
# TODO: Use mise.
brew "ruff"
brew "lf"
brew "zx"
brew "fx"
brew "fd"
brew "micronaut"
brew "zoxide"
brew "x-cmd"
brew "zsh"
brew "bash"
brew "starship"
brew "mise"
brew "podman"
brew "watch"
brew "translate-shell"
brew "tree"
brew "tfenv"
brew "socat"
brew "slides"
brew "pipx"
brew "presenterm"
brew "pulumi"
brew "neofetch"
brew "ktlint"
brew "ipcalc"
brew "colima"

# brew "tree-sitter"
# brew "lnav"
# brew "helix"
# brew "micro"
# brew "kakoune"
# brew "ollama"

# Casks

cask "macfuse"
cask "alacritty"
cask "firefox"
cask "google-chrome"
cask "font-jetbrains-mono-nerd-font"
cask "zoom"
cask "todoist-app"
cask "obsidian"
cask "itsycal"
cask "raycast"
cask "shottr"
cask "telegram-desktop"
cask "1password"
cask "hiddenbar"
cask "keepingyouawake"
cask "processing"
cask "beekeeper-studio"
cask "vlc"
cask "whatsapp"
cask "rectangle"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "cursor"

# Misc
# cask "font-hack-nerd-font"
# cask "font-jetbrains-mono"
# cask "ghostty"
# cask "wezterm"
# cask "amethyst"
# cask "chatbox"
cask "kitty"
cask "ledger-live"
cask "trae"
cask "windsurf"
cask "bitwarden"
cask "zen"
cask "zed"
cask "love"
cask "affine"
cask "anytype"
cask "appflowy"
cask "joplin"
cask "siyuan"
cask "notion"
cask "logseq"
cask "yandex-disk"
cask "steam"
cask "stats"
cask "spotify"
cask "megasync"
