# cask_args appdir: "~/Applications", require_sha: true

# Editors
brew "neovim"
brew "helix"
# brew "micro"
# brew "kakoune"

brew "ncdu"
brew "lnav"
brew "hl"
brew "kubernetes-cli"
brew "helmfile"
brew "helm"

brew "stow"
brew "ansible"
brew "fzf"
brew "git"
brew "ollama"
brew "bat"
brew "glow"
brew "bazel"
brew "tealdeer"
brew "biome"
brew "tmux"
brew "joshmedeski/sesh/sesh"
brew "tree"
brew "htop"
brew "coreutils"
brew "uv"
brew "ctop"
brew "d2"
brew "wget"
brew "curl"
brew "wrk"
brew "jq"
brew "yq"
brew "xplr"
brew "k6"
brew "ripgrep"
brew "duf"
brew "dust"
brew "dua-cli"
brew "lazydocker"
brew "lazygit"
brew "eza"
brew "ruff"
brew "lf"
brew "zx"
brew "fx"
brew "fd"
brew "micronaut"
brew "zoxide"
brew "x-cmd"

# TODO: Should we try something like fish?
brew "zsh"
# TODO: Do I need that?
brew "zsh-autosuggestions"
brew "zplug"

brew "bash"
brew "starship"
brew "mise"

# Casks"

cask "firefox"
cask "alacritty"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "itsycal"
cask "obsidian"
cask "raycast"
cask "todoist"
cask "zoom"
cask "visual-studio-code"
cask "affine"
cask "anytype"
cask "appflowy"
cask "joplin"
cask "siyuan"
cask "1password"
cask "bitwarden"
cask "chatbox"
cask "hiddenbar"
cask "keepingyouawake"
cask "love"
cask "processing"
cask "shottr"
cask "beekeeper-studio"
cask "ghostty"
cask "wezterm"
cask "vlc"
cask "macfuse"

# Tiling window manager
cask "amethyst"
cask "rectangle"

# cask "intellij-idea-ce"
# cask "kitty"
# cask "kitty"
# cask "telegram-desktop"
# cask "ledger-live"
